design_blog/app/controllers/posts_controller.rb

  def create
    post = Post.create(post_params)
---
INSERT INTO "posts" ("user_id", "post_content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["post_content", "Awesome"], ["created_at", "2021-04-13 01:13:09.850576"], ["updated_at", "2021-04-13 01:13:09.850576"]]

  def show
    @posts = Post.find_by(id: params['id'])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]